# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or https://github.com/wayofdev/mac-provisioner
#
# See https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "buo/cask-upgrade"                      # https://github.com/buo/homebrew-cask-upgrade
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "autoconf"                             # Configuration shell script maker
brew "bash"                                 # Bourne again shell
brew "bat"                                  # Clone of cat tool with syntax highlighting and Git integration
brew "chezmoi"                              # Chezmoi dotfiles manager
brew "ctop"                                 # Top-like interface for container metrics
brew "curl"                                 # Get a file from an HTTP, HTTPS or FTP server
brew "flake8"                               # Python style guide enforcer
brew "fswatch"                              # File change monitor
brew "geoip"                                # Geographic IP lookup
brew "git-lfs"                              # Git extension for versioning large files
brew "gnupg"                                # GNU privacy guard
brew "htop"                                 # Interactive system-monitor
brew "less"                                 # Terminal pager
brew "lesspipe"                             # Input filter for `less`
brew "mackup"                               # Keep your Mac's application settings in sync
brew "mc"                                   # Terminal-based visual file manager
brew "mpdecimal"                            # Library for decimal floating point arithmetic
brew "nano"                                 # Nano text editor
brew "navi"                                 # An interactive cheatsheet tool for the command-line
brew "neofetch"                             # System information tool
brew "neovim"                               # Ambitious Vim-fork focused on extensibility and agility
brew "pinentry-mac"                         # Pinentry for GPG on Mac
brew "rbenv"                                # Ruby environment manager
brew "ripgrep"                              # Recursive Regex search tool
brew "rsync"                                # File transfer and sync tool
brew "ruby-build"                           # Ruby version manager
brew "screen"                               # Terminal multiplexer
brew "shellcheck"                           # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt"                                # Autoformat shell script source code
brew "sqlite"                               # Command-line interface for SQLite
brew "telnet"                               # Virtual terminal client
brew "unison"                               # Unison file synchronizer
brew "wget"                                 # Web content downloader
brew "zsh"                                  # UNIX shell (command interpreter)

cask "font-hack-nerd-font"
cask "iterm2"
